{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1024],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[512,1],"strides":[4,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D4","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D4",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D5","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D5",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["dropout_Dropout5",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D6","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D6","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization6",0,0,{}]]]},{"name":"dropout_Dropout6","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D6",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":126,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"dropout_Dropout7","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout7","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout7",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[512,1,1,256],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[64,1,256,64],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[64,1,64,64],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[64,1,64,64],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[64,1,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[64,1,128,256],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[512,126],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[126],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[126,3],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[3],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[256],"dtype":"float32"}]}]}