{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,2048],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[32,32,2],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[11,11],"strides":[5,5],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"linear","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["activation_Activation1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"activation_Activation2","class_name":"Activation","config":{"activation":"linear","name":"activation_Activation2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["activation_Activation2",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"activation_Activation3","class_name":"Activation","config":{"activation":"linear","name":"activation_Activation3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["activation_Activation3",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"activation_Activation4","class_name":"Activation","config":{"activation":"linear","name":"activation_Activation4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["activation_Activation4",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":3,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"activation_Activation5","class_name":"Activation","config":{"activation":"linear","name":"activation_Activation5","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["activation_Activation5",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[11,11,2,64],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,64,32],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,32,32],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[3136,3],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"}]}]}