{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,2048],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[2048,1,1],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1024,1],"strides":[8,8],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"re_lu_ReLU1","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["re_lu_ReLU1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[512,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"re_lu_ReLU2","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["re_lu_ReLU2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[512,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"re_lu_ReLU3","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["re_lu_ReLU3",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[512,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"re_lu_ReLU4","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["re_lu_ReLU4",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D4","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":25,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"re_lu_ReLU5","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["re_lu_ReLU5",0,0,{}]]]},{"name":"re_lu_ReLU6","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU6","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["re_lu_ReLU6",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[1024,1,1,64],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[512,1,64,8],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[512,1,8,8],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[512,1,8,2],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[2],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[32,25],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[25],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[25,4],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[4],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[2],"dtype":"float32"}]}]}