{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1024],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"sound2_image_Sound2Image1","class_name":"Sound2Image","config":{"name":"sound2_image_Sound2Image1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"image_net_ImageNet1","class_name":"ImageNet","config":{"name":"image_net_ImageNet1","trainable":true},"inbound_nodes":[[["sound2_image_Sound2Image1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":5000,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.03}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["image_net_ImageNet1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1000,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.03}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":3,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense3",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[1001,5000],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[5000],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[5000,1000],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[1000,3],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[3],"dtype":"float32"}]}]}