{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1024],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[512,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[24,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[3,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[512,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[24,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"kernel_constraint":null,"kernel_size":[3,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"globalAverageLow","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"globalAverageLow","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"globalAverageMid","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"globalAverageMid","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"globalAverageHigh","class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"globalAverageHigh","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["globalAverageLow",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["globalAverageMid",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["globalAverageHigh",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1024,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":1024,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":1024,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"reshape_Reshape4","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"reshape_Reshape4","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"multiply_Multiply1","class_name":"Multiply","config":{"name":"multiply_Multiply1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}],["reshape_Reshape2",0,0,{}]]]},{"name":"multiply_Multiply2","class_name":"Multiply","config":{"name":"multiply_Multiply2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}],["reshape_Reshape3",0,0,{}]]]},{"name":"multiply_Multiply3","class_name":"Multiply","config":{"name":"multiply_Multiply3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}],["reshape_Reshape4",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}],["multiply_Multiply1",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}],["multiply_Multiply2",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}],["multiply_Multiply3",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}],["max_pooling2d_MaxPooling2D2",0,0,{}],["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"flatten","class_name":"GlobalMaxPooling2D","config":{"data_format":"channels_last","name":"flatten","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.1}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["flatten",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense7",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[512,1,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[24,1,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,1,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[512,1,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[24,1,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,1,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[16,1024],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,1024],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[16,1024],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[48,3],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[3],"dtype":"float32"}]}]}